# Pandas 3 Atsakymai

In [1]:
import numpy as np
import pandas as pd

# 1 Ištraukite lentelę iš [šios](https://work.studentnews.eu/s/3695/75547-European-countries-the-table-language-population-capital-currency-phone-code-internet-code.htm) svetainės. Išsaugokite kintamąjame.

In [3]:
html = pd.read_html('https://work.studentnews.eu/s/3695/75547-European-countries-the-table-language-population-capital-currency-phone-code-internet-code.htm')

In [10]:
html[1].head()

,Staat,Official languages,Population,Capital,Currency,Phone,Int.
0,Austria,German,8.4 million,Vienna,euro (EUR),43,.at
1,Belgium,"Dutch (north), French (south), German",11 million,Brussels,euro (EUR),32,.be
2,Bulgaria,Bulgarian,7 million,Sofia,Bulgarian lev (BGN),359,.bg
3,Croatia,Croatian,4.3 million,Zagreb,Croatian kuna (HRK),385,.hr
4,Cyprus,"Greek, Turkish",800 000,Nicosia,euro (EUR),357,.cy

In [11]:
countries = html[1]

# 2 šių duomenų pagrindu sukurkite CSV, Excelio failus, ir SQLite3 duomenų bazę. Patikrinkite, ar suveikė.

In [14]:
countries.to_csv('countries.csv', index=False)
countries.to_excel('countries.xls', 'Sheet1', index=False)

from sqlalchemy import create_engine
engine = create_engine('sqlite:///countries.db')
countries.to_sql('countries', con=engine, index=False)

# 3 Nuskaitykite į DF šį [failą]()

In [15]:
fires = pd.read_csv('top_20_CA_wildfires.csv')

In [68]:
fires.head()

,fire_name,cause,month,year,county,acres,structures,deaths
0,Mendocino Complex,Under Investigation,7,2018,"Colusa County, Lake County, Mendocino County &...",459123,280,1
1,Thomas,Powerlines,12,2017,Ventura & Santa Barbara,281893,1063,2
2,Cedar,Human Related,10,2003,San Diego,273246,2820,15
3,Rush,Lightning,8,2012,Lassen,271911,0,0
4,Rim,Human Related,8,2013,Tuolumne,257314,112,0

# 4 Kiek unikalių reikšmių yra stulpelyje 'cause'?

In [19]:
len(fires['cause'].unique())

5

# 5 Kokios priežastys, kiek kartų pasitaiko lentelėje?

In [28]:
fires['cause'].value_counts()

Human Related          7
Lightning              7
Powerlines             4
Undetermined           1
Under Investigation    1
Name: cause, dtype: int64

# 6 Kuriais metais buvo daugiausia gaisrų?

In [43]:
fires['year'].value_counts().idxmax()

2018

# 7 Kiek buvo tokių gaisrų, kuriuose žuvo žmonės?

In [33]:
fires['deaths'].value_counts().drop(0).sum()

10

# 8 Surūšiuokite eilutes pagal metus. Išsiaiškinkite, kaip rūšiuoti, kad naujausi gaisrai būtų viršuje

In [23]:
fires.sort_values('year', ascending=False).head()

,fire_name,cause,month,year,county,acres,structures,deaths
0,Mendocino Complex,Under Investigation,July,2018,"Colusa County, Lake County, Mendocino County &...",459123,280,1
15,Camp Fire,Powerlines,November,2018,Butte,153336,18804,85
6,Carr,Human Related,July,2018,"Shasta County,Trinity County",229651,1614,8
1,Thomas,Powerlines,December,2017,Ventura & Santa Barbara,281893,1063,2
16,Rough,Lightning,July,2015,Fresno,151623,4,0

# 9 Parašykite funkciją, kuri mėnesio pavadinimą verstų skaičiumi. Naudodami .apply() lentelėje pakeiskite mėnesių pavadinimus skaičiais. 
*nusikopijuokite žodyną, kad nereikėtų rašyti ranka :)*

In [57]:
menesiai = {1: 'January',
  2: 'February',
  3: 'March',
  4: 'April',
  5: 'May',
  6: 'June',
  7: 'July',
  8: 'August',
  9: 'September',
  10: 'October',
  11: 'November',
  12: 'December'}

In [61]:
def months_to_nums(month):
    months = {1: 'January',
  2: 'February',
  3: 'March',
  4: 'April',
  5: 'May',
  6: 'June',
  7: 'July',
  8: 'August',
  9: 'September',
  10: 'October',
  11: 'November',
  12: 'December'}
    for idx, mn in months.items():
        if mn == month:
            return idx

In [62]:
months_to_nums('July')

7

In [65]:
fires['month'] = fires['month'].apply(months_to_nums)

In [67]:
fires.head()

,fire_name,cause,month,year,county,acres,structures,deaths
0,Mendocino Complex,Under Investigation,7,2018,"Colusa County, Lake County, Mendocino County &...",459123,280,1
1,Thomas,Powerlines,12,2017,Ventura & Santa Barbara,281893,1063,2
2,Cedar,Human Related,10,2003,San Diego,273246,2820,15
3,Rush,Lightning,8,2012,Lassen,271911,0,0
4,Rim,Human Related,8,2013,Tuolumne,257314,112,0

# 10 Nuskaitykite lentelę iš [čia](https://lt.wikipedia.org/wiki/S%C4%85ra%C5%A1as:Lietuvos_miestai_pagal_gyventojus).

* **Pakeiskite indeksą į stulpelį 'Miestas'**
* **Sutvarkykite duomenis taip, kad gyventojų sk. reprezentuotų lengelis su 'int' reikšme: -
Ten kur trūksta duomenų - nulis. 
ten, kur reikšmės ne integer, sutvarkykite, kad būtų integer.**

In [367]:
data = pd.read_html('https://lt.wikipedia.org/wiki/S%C4%85ra%C5%A1as:Lietuvos_miestai_pagal_gyventojus')

In [368]:
# Pasitikriname sąrašo ilgį
len(data)

1

In [369]:
# kadangi sąrašas iš vieno elemento nereikia spėlioti. Patogumo dėlei persivadiname DF. 
miestai = data[0]

In [370]:
miestai.head()

,Miestas,2019 m.,2011 m.,2001 m.,1989 m.,1979 m.,1970 m.,1959 m.,1923 m.,1897 m.
0,Vilnius,540 919,535631,542287,576747,475825,370153,236100,167400,154532*
1,Kaunas,286 763,315993,378650,419745,370000,305600,216850,92446,70920*
2,Klaipėda,147 898,162360,192954,202929,176648,140342,89500,35845,20100
3,Šiauliai,100 119,109328,133883,145629,118724,92375,59700,21387,16128*
4,Panevėžys,87 148,99690,119749,126483,102303,74497,41100,19197,12968*

In [371]:
miestai.info()
# Matome, kad reikės tvarkyti 2019, 2011, 1989, 1923, 1897 stulpelius

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103 entries, 0 to 102
Data columns (total 10 columns):
Miestas    103 non-null object
2019 m.    103 non-null object
2011 m.    103 non-null int64
2001 m.    103 non-null int64
1989 m.    103 non-null object
1979 m.    103 non-null int64
1970 m.    103 non-null int64
1959 m.    103 non-null int64
1923 m.    103 non-null object
1897 m.    103 non-null object
dtypes: int64(5), object(5)
memory usage: 8.1+ KB

In [372]:
miestai.set_index('Miestas', inplace=True)

In [373]:
col_list = miestai.columns.tolist()

In [374]:
col_list

['2019\xa0m.',
 '2011\xa0m.',
 '2001\xa0m.',
 '1989\xa0m.',
 '1979\xa0m.',
 '1970\xa0m.',
 '1959\xa0m.',
 '1923\xa0m.',
 '1897\xa0m.']

In [375]:
# Kad būtų patogiau, persivadinkim stulpelius

new_list = []
for item in col_list:
    fixed = item.replace('\xa0m.', '')
    new_list.append(fixed)

miestai.columns = new_list

In [376]:
miestai.head()

,2019,2011,2001,1989,1979,1970,1959,1923,1897
Miestas,,,,,,,,,
Vilnius,540 919,535631,542287,576747,475825,370153,236100,167400,154532*
Kaunas,286 763,315993,378650,419745,370000,305600,216850,92446,70920*
Klaipėda,147 898,162360,192954,202929,176648,140342,89500,35845,20100
Šiauliai,100 119,109328,133883,145629,118724,92375,59700,21387,16128*
Panevėžys,87 148,99690,119749,126483,102303,74497,41100,19197,12968*

In [377]:
# Iš karto matyti, kad 2019 reikšmės yra string, pasitikrinkime, ar bent viena yra int:
any([isinstance(x, int) for x in miestai['2019']])

False

In [378]:
# Gaminame funkciją stulpeliui 2019 sutvarkyti:
def fix_2019(value):
    if ' ' in value:
        return int(value.replace(' ', ''))
    return int(value)

In [379]:
fix_2019('540 919')

540919

In [380]:
fix_2019('123')

123

In [381]:
miestai['2019'] = miestai['2019'].apply(fix_2019)

In [382]:
miestai.info()

<class 'pandas.core.frame.DataFrame'>
Index: 103 entries, Vilnius to Panemunė
Data columns (total 9 columns):
2019    103 non-null int64
2011    103 non-null int64
2001    103 non-null int64
1989    103 non-null object
1979    103 non-null int64
1970    103 non-null int64
1959    103 non-null int64
1923    103 non-null object
1897    103 non-null object
dtypes: int64(6), object(3)
memory usage: 8.0+ KB

In [383]:
any([isinstance(x, int) for x in miestai['1989']])

False

In [384]:
# mėginame ištaisyti 1989 stulpelį su 2019 fix'u ir mums pavyksta :)
miestai['1989'] = miestai['1989'].apply(fix_2019)

In [385]:
# matome, kad liko paskutiniai du stulpeliai:
miestai.info()

<class 'pandas.core.frame.DataFrame'>
Index: 103 entries, Vilnius to Panemunė
Data columns (total 9 columns):
2019    103 non-null int64
2011    103 non-null int64
2001    103 non-null int64
1989    103 non-null int64
1979    103 non-null int64
1970    103 non-null int64
1959    103 non-null int64
1923    103 non-null object
1897    103 non-null object
dtypes: int64(7), object(2)
memory usage: 8.0+ KB

In [386]:
len([not isinstance(x, int) for x in miestai['2019']])

103

In [387]:
#bandome ištaisyti reikšmes, kurios leidžiasi ištaisomos: 
def fix_1923(x):
    try:
        return int(x)
    except:
        return x

In [388]:
miestai['1923'] = miestai['1923'].apply(fix_1923)

In [389]:
miestai.head()

,2019,2011,2001,1989,1979,1970,1959,1923,1897
Miestas,,,,,,,,,
Vilnius,540919,535631,542287,576747,475825,370153,236100,167400,154532*
Kaunas,286763,315993,378650,419745,370000,305600,216850,92446,70920*
Klaipėda,147898,162360,192954,202929,176648,140342,89500,35845,20100
Šiauliai,100119,109328,133883,145629,118724,92375,59700,21387,16128*
Panevėžys,87148,99690,119749,126483,102303,74497,41100,19197,12968*

In [390]:
miestai['1897'] = miestai['1897'].apply(fix_1923)

In [391]:
# matome, kad paskutiniai du stulpeliai vis dar turi negerų reikšmių:
miestai.info()

<class 'pandas.core.frame.DataFrame'>
Index: 103 entries, Vilnius to Panemunė
Data columns (total 9 columns):
2019    103 non-null int64
2011    103 non-null int64
2001    103 non-null int64
1989    103 non-null int64
1979    103 non-null int64
1970    103 non-null int64
1959    103 non-null int64
1923    103 non-null object
1897    103 non-null object
dtypes: int64(7), object(2)
memory usage: 8.0+ KB

In [392]:
# pasigaminame filtrus, pagal kuriuos galėsime pažiūrėti likusias neištaisytas reikšmes:
salyga_1897 = [not isinstance(x, int) for x in miestai['1897']]
salyga_1923 = [not isinstance(x, int) for x in miestai['1923']]

In [393]:
miestai['1923'].loc[salyga_1923]

Miestas
Švenčionėliai    (??)
Nemenčinė        (??)
Trakai           (??)
Švenčionys       (??)
Neringa           (?)
Rūdiškės         (??)
Varniai           (?)
Subačius          (?)
Užventis          (?)
Name: 1923, dtype: object

In [394]:
miestai['1897'].loc[salyga_1897]

Miestas
Vilnius                154532*
Kaunas                  70920*
Šiauliai                16128*
Panevėžys               12968*
Marijampolė              6737*
Telšiai                  6205*
Ukmergė                 13532*
Raseiniai                7455*
Vilkaviškis              5788*
Prienai                  2477*
Zarasai                  6359*
Šakiai                   2211*
Švenčionėliai              (?)
Trakai                   3240*
Švenčionys               6025*
Kalvarija                9378*
Neringa                    (?)
Šeduva                   4474*
Rūdiškės                   (?)
Kudirkos Naumiestis      4595*
Priekulė                   (?)
Virbalis                 3293*
Smalininkai                (?)
Name: 1897, dtype: object

In [395]:
miestai.replace(['(??)', '(?)'], int(0), inplace=True)

In [396]:
# patikriname dar kartą, tikimės, kad bus tuščia, tačiau deja :) 
miestai['1923'].loc[salyga_1923]

Miestas
Švenčionėliai    0
Nemenčinė        0
Trakai           0
Švenčionys       0
Neringa          0
Rūdiškės         0
Varniai          0
Subačius         0
Užventis         0
Name: 1923, dtype: int64

In [398]:
# patikriname, kad per duomenų tipas, paaiškėja, kad jis mums tinka.
type(miestai['1923'].loc['Trakai'])

numpy.int64

In [399]:
# liko paskutinis stulpelis
miestai.info()

<class 'pandas.core.frame.DataFrame'>
Index: 103 entries, Vilnius to Panemunė
Data columns (total 9 columns):
2019    103 non-null int64
2011    103 non-null int64
2001    103 non-null int64
1989    103 non-null int64
1979    103 non-null int64
1970    103 non-null int64
1959    103 non-null int64
1923    103 non-null int64
1897    103 non-null object
dtypes: int64(8), object(1)
memory usage: 13.0+ KB

In [400]:
miestai['1897'].loc[salyga_1897]

Miestas
Vilnius                154532*
Kaunas                  70920*
Šiauliai                16128*
Panevėžys               12968*
Marijampolė              6737*
Telšiai                  6205*
Ukmergė                 13532*
Raseiniai                7455*
Vilkaviškis              5788*
Prienai                  2477*
Zarasai                  6359*
Šakiai                   2211*
Švenčionėliai                0
Trakai                   3240*
Švenčionys               6025*
Kalvarija                9378*
Neringa                      0
Šeduva                   4474*
Rūdiškės                     0
Kudirkos Naumiestis      4595*
Priekulė                     0
Virbalis                 3293*
Smalininkai                  0
Name: 1897, dtype: object

In [419]:
# pasigaminame funkciją, kuri naikins asteriksus:

def remove_asterix(val):
    if type(val) == str:
        return val.replace('*', '')
    return val

In [421]:
miestai['1897'] = miestai['1897'].apply(remove_asterix)